/*
 ────────────────────────────────────────── License ─────────────────────────────────────────────────
 This file is part of the XXX Stack: GLFW-Skia-CPP-Template
 Copyright (c) 2025 Nico Jan Eelhart.
 Licensed under the MIT License. See the LICENSE.md file in the root directory of  this source tree.
────────────────────────────────────────────────────────────────────────────────────────────────── */


 /* ──────────────────────────────────────────────────────────────────────────────────────────────────
 🧠 PURPOSE:  Declares the Skia Canvas class and related functions to support drawing

 📄 Description This header exposes the C++ interface for creating, controlling, and querying
                Skia related canvas information
 ────────────────────────────────────────────────────────────────────────────────────────────────── */
