
/*
 ────────────────────────────────────────── License ─────────────────────────────────────────────────
 This file is part of the Stack: GLFW-Skia-CPP-Template
 Copyright (c) 2025 Nico Jan Eelhart.
 Licensed under the MIT License. See the LICENSE.md file in the root directory of  this source tree.
────────────────────────────────────────────────────────────────────────────────────────────────── */


 /* ──────────────────────────────────────────────────────────────────────────────────────────────────
 🧠 PURPOSE:  Declares the global Skia classes and related functions

 📄 Description 
 ────────────────────────────────────────────────────────────────────────────────────────────────── */

#pragma once



